<?php
function knapsack($W, $wt_val, $N)
{
    $dp = array_fill(0, $N + 1, array_fill(0, $W + 1, 0)); //品物の数, 重さを表した配列を0で初期化

    // i=0,すべての重さに対して価値は0
    for ($w = 0; $w <= $W; $w++) {
        $dp[0][$w] = 0;
    }

    // ナップサックに何も入れないとき、すべての品物の価値は0
    for ($i = 0; $i <= $N; $i++) {
        $dp[$i][0] = 0;
    }

    for ($i = 1; $i <= $N; $i++) { //縦軸
        for ($w = 1; $w <= $W; $w++) { //横軸
            // 品物iをナップサックに追加できる場合
            if ($wt_val[$i - 1][0] <= $w) {
                $dp[$i][$w] = max(
                    $wt_val[$i - 1][1] + $dp[$i - 1][$w - $wt_val[$i - 1][0]], //品物重さ + (総重量-品物の重さ)
                    $dp[$i - 1][$w]
                );
            } else {
                // 追加できない場合、価値は前の品物までの価値と同じ
                $dp[$i][$w] = $dp[$i - 1][$w];
            }
        }
    }
    print_r($dp);
    return $dp[$N][$W];
}

$N = 6;  //品物の個数
$W = 15; //重さの総和
$wt_val = [[2, 3], [1, 2], [3, 6], [2, 1], [1, 3], [5, 85]]; //品物の重さ_価値

echo knapsack($W, $wt_val, $N) . PHP_EOL;  // 最大の価値を表示
